/*

1. Дано два масиви: [1, 2, 3] і [4, 5, 6]. Об'єднайте їх у масив: [1, 2, 3, 4, 5, 6].
2. Дано масив [1, 2, 3]. Зробити з нього масив [3, 2, 1].
3. Даний масив [3, 4, 5]. Додайте йому в кінець елементи 4, 8. 10.
4. Даний масив ['aaa', 'bbb', 'ccc']. Виведіть в консоль останній елемент та видаліть його з масива.
5. Даний масив ['3', 7, 10]. Додайте йому на початок елементи 2, 8.
6. Даний масив ['3', 7, 10]. Отримайте з нього рядок.

*/

// 1
const arr1 = [1, 2, 3];
const arr2 = [4, 5, 6];
const arr3 = arr1.concat(arr2);

// 2
const arr4 = [1, 2, 3];
arr4.reverse();

// 3
const arr5 = [3, 4, 5];
arr5.push(4, 8, 10);

// 4
const arr6 = ['aaa', 'bbb', 'ccc'];
//console.log(arr6.pop());

// 5
const arr7 = ['3', 7, 10];
arr7.unshift(2, 8);

// 6
const result = arr7.join(' --- ');
console.log(result);