/* Задача 1

1. З масиву [1, 2, 3, 4, 5] зробіть масив [1, 4, 5]
2. З масиву [1, 2, 3, 4] запишіть в новий масив [2, 3, 4]
3. З масиву [1, 2, 3, 4, 5] зробіть масив [1, 'w', 'tr-td', 2, 3, 4, 'vv', 5, 'aa']


*/

// 1
const array1 = [1, 2, 3, 4, 5];
array1.splice(1, 2);

// 2
const array2 = [1, 2, 3, 4];
const array3 = array2.slice(1);

// 3
const array4 = [1, 2, 3, 4, 5];
array4.splice(1, 0, 'w', 'tr-td');
// variant 1
// array4.splice(6, 0, 'vv');
// array4.push('aa');
// variant 2
array4.splice(-1, 1, 'vv', 5, 'aa');

/* Задача 2 (*, не обов'язкова)

Напишіть функцію, яка приймає масив і перевіряє, чи є в масиві два однакових елемента поспіль.
Масив приймаємо як аргумент функції,
функція повертає true, якщо є два однакових елемента поспіль.
функція повертає false, якщо двох однакових елементів поспіль у масиві немає

[1, 2, 3, 4, 5] // false
[1, 2, 2, 3, 4] // true

Суть вирішення:
потрібно переглянути масив циклом;
на кожній ітерації циклу порівнювати поточне число з наступним числом у масиві ->
-> якщо число поточне і число наступне співпали - повертаємо true з функції
-> якщо число поточне і число наступне НЕ співпали - нічого не робимо

array[i] - поточне число
array[i + 1] - наступне число

*/

function isDoubleElement(array) {
    for(let i = 0; i < array.length - 1; i++) {
        if(array[i] === array[i + 1]) {
            return true;
        }
    }
    return false;
}