/* Задача 1 :^

prompt
Виведіть користувачу пропозицію меню:
1 - Сік
2 - Вода
3 - Кава
4 - Чай
5 - Лимонад

Вивести в консоль напій, цифру якого ввів користувач
Зробіть, будь ласка, через switch-case

*/

const userChoice = Number(prompt('Оберіть напій: \n1 - Сік \n2 - Вода \n3 - Кава \n4 - Чай \n5 - Лимонад'));

switch(userChoice) {
    case 1: {
        console.log('Сік');
        break;
    }
    case 2: {
        console.log('Вода');
        break;
    }
    case 3: {
        console.log('Кава');
        break;
    }
    case 4: {
        console.log('Чай');
        break;
    }
    case 5: {
        console.log('Лимонад');
        break;
    }
    default: {
        console.log('Оберіть щось із меню');
    }
}


/* Задача 2 (за бажанням)

Зробити калькулятор =)

Користувач послідовно (один за одним) вводить
- Перше число
- Друге число
- Один з варіантів: +, -, *, /

Для кожної математичної дії (+, -, *, /) зробіть окрему функцію.
Весь калькулятор - це теж окрема функція, роль якої - спитати у користувача два числа і дію і повернути йому результат в якості alert.

P.S. Повна творча свобода.
Якщо ви бачите рішення цієї задачі якось по-іншому - Ви можете реалізувати своє бачення калькулятора.

*/