// Математичні оператори

// Бінарні оператори - коли потрібно 2 операнди

let a = 2 + 2; // 4
let b = 2 - 2; // 0
let c = 2 * 2; // 4
let d = 2 / 2; // 1

// Унарні оператори - коли потрібен тільки 1 операнд

let e = -2;


// % - Залишок від цілочисельного поділу

/*

Задача 1.

Дано:
Тістечок - 12
Друзів - 3
Розділити порівну - ?

Рішення:
12 / 3 = 4 (тістечка)

Кожному другу дістанеться по 4 тістечка і у нас не залишиться зайвих тістечок (цілочисельне ділення)
Залишок від цілочисельного поділу - 0

Задача 2.

Дано:
Тістечок - 15
Друзів - 6
Розділити порівну - ?

Рішення:
1) 15 / 6 = 2.5
Ціле: 2
2) 6 * 2 = 12 тістечок
Кожний друг, а їх всього 6, гарантовано отримає по 2 тістечка 
3) 15 - 12 = 3 (тістечка) - залишок

Число 2 - результат цілочисельного поділу (скільки тістечок отримає кожний друг без залишку)
Число 3 - залишок від цілочисельного поділу

*/

// Залишок від цілочисельного поділу - число, яке залишається після того, як одне ціле число ділиться на інше ціле число без залишку

// Вирішення задачі 2 з використанням спеціального оператора
let rest = 15 % 6;
console.log(rest); // 3

// Задача: визначити парність / непарність числа
// Чи є число 4 - парним числом?

let pair = 4 % 2; // 0
console.log(pair);
// В залишку 0 при діленні на 2 - число парне

let unPair = 5 % 2; // 1
console.log(unPair);
// В залишку не 0 при діленні на 2 - число непарне




// ** - оператор ступеня (степени)

// Задача: піднести 2 у 9 степінь (2^9)
// const x3 = 2 * 2 * 2 * 2 * 2 * 2 * 2 * 2 * 2; - 1 спосіб (hardcore)
const x3 = 2 ** 9; // - 2 спосіб (good)
console.log(x3);