/*

Задача 1

Зробити функцію-конструктор Country, яка приймає в якості аргументів:
- назва країни
- популяція (population)
- площа (area)
Спроектувати метод густоти населення
P.S. Густота наеселення = популяція цієї країни / площу цієї ж країни

*/

function Country(name, population, area) {
  this.name = name;
  this.population = population;
  this.area = area;

  this.getDensity = function() {
    return this.population / this.area;
  }
}

const UK = new Country('United Kingdom', 67333000, 243610);

/*

Задача 2

Зробити функцію-конструктор Авто, яке має:
- назву
- максимальну швидкість
- поточну швидкість
Спроектувати методи:
- метод прискорення (accelearte) - приймає в якості аргумента певне прискорення
Зауважте, що при прискоренні, поточна швидкісь не може бути більшою за максимальну швидкість
- метод сповільнення (deaccelerate) - приймає в якості аргумента певне сповільнення
Зауважте, що при сповільненні, поточна швидкість не може бути менше за 0
- метод зупинки (stop)

*/