// 1. () - оператор виклику функції
console.log();

// 2. () - для групування виразів. Можемо вказувати пріорітети виконання арифметичних операцій
const sum = (2 + 2) * 6;
console.log(sum);


// Екранування

// Задача: створити змінну з цитатою

const hello = 'Маша сказала: "Привіт"'; // метод вирішення - різні типи лапок
// одинарні лапки - відкривають/закривають строку
// подвійні лапки - для прямої мови
console.log(hello);

/* Екранування (escape) - коли ми використовуємо спец.символи або 
послідовності символів для вставки недопустимих символів у рядок */
//       \

const helloEscape = 'Маша сказала: \'Привіт\''; // метод вирішення - екранування
console.log(helloEscape);

const test = '- Мені сьогодні прийшла зарплата, а тобі? \n- Мені також прийшла, чудово!';
console.log(test);