// Increment, decrement

let superNumber = 1;

// Задача: збільшити значення змінної superNumber на 1
superNumber++; // 1 + 1 = 2
// Значення збільшується на 1

// Інкремент (++) - операція, яка використовується для збільшення числа на 1.
// Декремент (--) - операція, яка використовується для зменшення числа на 1.
superNumber--; // 1 - 1 = 0
// Значення зменшується на 1

// Prefix
++superNumber; // Інкремент буде виконано першим ділом, потім всі інші операції
--superNumber; // Декремент буде виконано першим ділом, потім всі інші операції

// Postfix
superNumber++; // Спочатку буде використано значення змінної, а після завершення операції змінна інкрементується
superNumber--; // Спочатку буде використано значення змінної, а після завершення операції змінна декрементується

console.log(--superNumber); // 1 - 1 = 0






let k = 0;

// Задача: збільшити значення k на 3
k = k + 3; // 3

// Задача: зменшити значення k на 2
k = k - 2; // -2

// Задача: збільшити значення k на 3
k += 3; // k = k + 3;

// Задача: зменшити значення k на 2
k -= 2; // k = k - 2;

k *= 4; // k = k * 4;

k /= 5; // k = k / 5;

// Унарні оператори
-k;
+k;

// "+" як оператор приведення строки до числа

let thisIsNumber = Number('455'); // good practice
// let thisIsNumber = +'455'; // bad practice
console.log(typeof thisIsNumber); 

/*

Бінарні оператори
"+" - оператор додавання
"+" - оператор конкатенації

Унарний "+" - оператор приведення строки до числа

*/