// if - якщо (если)
// if - оператор логічної умови у JS
/* if - це спосіб перевірити, 
чи виконується певна умова, і в залежності від цього зробити певні дії
або виконати певний код
*/

// Якщо сонце сходить (умова є істинною) - ви плануєте піти на прогулянку
// Якщо сонце не сходить (умова є хибною) - ви залишаєтеся вдома

/*

Синтасис if:

if(логічна операція, результатом якої буде тип Boolean) {
    блок коду, який буде виконуватись, якщо умова = true (істина)
}

*/

if(2 + 2 === 5) {
    //console.log('Числа рівні між собою!'); // виконається якщо умова = true
}

// if-else
// else - інакше (в противному випадку)

/*

Синтаксис if-else:

if(логічна операція, результатом якої буде тип Boolean) {
    блок коду, який буде виконуватись, якщо умова = true (істина)
} else {
    блок коду, який буде виконуватись, якщо умова = false (хиба)
}

*/

if(2 + 2 === 5) {
    console.log('Числа рівні між собою!'); // виконається якщо умова = true
} else {
    console.log('Числа не рівні між собою'); // // виконається якщо умова = false
}