/* for 

for(початковий стан; умова, за якої цикл повторюється; зміна лічильника на кожній ітерації) {
  блок коду, який повторюється
}


Початковий стан - початкове значення для лічильника

*/

// Задача: Вивести 10 консоль.логів

// for (let i = 0; i < 10; i = i + 3) {
//   // 0 -> 3 -> 6 -> 9 -> 12 (false)
//   console.log(i);
// }

/*

Задача: написати функцію, яка обчислює факторіал переданого їй числа, результат роботи функції вивести на консоль

Факторіал - це
5! = 1*2*3*4*5 = 120
10! = 1*2*3*4*5*6*7*8*9*10

Якщо число від'ємне - поверніть з функції помилку
Якщо число = 0, або = 1 - поверніть з функції 1
Знаходимо факторіал...=)

*/

function factorial(number) {
  let res = 1; // у цій змінній ми будемо накопичувати добуток

  if (number === 0 || number === 1) {
    return 1;
  } else if (number < 0) {
    return NULL;
  }

  for (let it = 1; it <= number; it++) {
      res = res * it;
  }

  return res;
}

console.log(factorial(10));
