/* 

Задача 1

Знайти факторіал числа

5! = 5*4*3*2*1 = 120
3! = 3*2*1
7! = 7*6*5*4*3*2*1

Задача 2 (*)

Описати знаходження послідовності чисел Фібоначчі:
F(n) = F(n-1) + F(n-2)

Іншими словами, наступне число є сумою двох попередніх.

0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987....

0
1
1 -->> F(1) = 1 + 0 = 1
2 -->> F(2) = 1 + 1 = 2
3 -->> F(3) = 2 + 1 = 3
5 -->> F(4) = 3 + 2 = 5
8 -->> F(5) = 5 + 3 = 8

*/

// Задача 1

function findFactorial(number) {
  if(number === 1) { // база рекурсії
    return 1
  } else {
    return number * findFactorial(number - 1);
  }
}

// Задача 2

function findFibonacci(n) {
  if(n === 0) {
    return 0;
  }

  if(n === 1) {
    return 1;
  }

  return findFibonacci(n - 1) + findFibonacci(n - 2);
}