/* Задача 1

Ми маємо змінну яка вказує на кількість хвилин в годині.
Визначити, в якій чверті години знаходиться ця кількість хвилин.

Якщо кількість хвилин попадає в першу чверть години (0-15 хвилин) - вивести на консоль "перша чверть".
Якщо кількість хвилин попадає в другу чверть години (16-30 хвилин) - вивести на консоль "друга чверть".
Якщо кількість хвилин попадає в третю чверть години (31-45 хвилин) - вивести на консоль "третя чверть".
Якщо кількість хвилин попадає в четверту чверть години (46-60 хвилин) - вивести на консоль "четверта чверть".

*/

/*
const minutes = 25;

if(minutes >= 0 && minutes <= 15) {
    console.log('перша чверть');
} else if (minutes > 15 && minutes <= 30) {
    console.log('друга чверть');
} else if (minutes > 30 && minutes <= 45) {
    console.log('третя чверть');
} else if (minutes > 45 && minutes <= 60) {
    console.log('Четверта чверть');
} else {
    console.log('Виникла помилка');
}
*/

/* Задача 2.

Ви зберігаєте у змінній рік.
Потрібно визначити, чи є цей рік високосним.
Примітка. Рік є високосним, якщо його номер кратний 4 І не кратний 100, АБО якщо він кратний 400.


*/

/*

const year = 1948;
if(year % 4 === 0 && year % 100 !== 0 || year % 400 === 0) {
    console.log(year + ' є високосним');
} else {
    console.log(year + ' НЕ є високосним');
}

*/

/* Задача 3.

У вас є задане початкове і кінцеве значення діапазону, і також певне число.
Вам потрібно визначити, чи входить це число в заданий діапазон, чи ні.
Якщо число знаходить між початковим і кінцевим значенням діапазону (включно), вивести "В діапазоні".
В іншому випадку вивести "Поза діапазоном", оскільки число знаходиться поза початковим та кінцевим значенням.

*/

/*

const left = 10; // початкове значення діапазону
const right = 20; // кінцеве значення діапазону

const number = 9;

// перевірка входження числа в діапазон
if(number >= left && number <= right) {
    console.log(number + ' є ' + '[' + left + '; ' + right + '];');
} else {
    console.log('Поза діапазоном');
}

*/

/* Задача 4.

Козак Вус проводить змагання з програмування, в якому беруть участь n людей.
Він вирішив нагородити їх усіх ручками та блокнотами.
Відомо, що Ус має рівно m ручок і k блокнотів.
Визначте, чи може козак Вус нагородити всіх учасників, даючи кожному з них щонайменше по одній ручці і одному блокноту.

*/

/*

const n = 5; // кількість учасників
const m = 19; // кількість ручок
const k = 15; // кількість блокнотів

if(m >= n && k >= n) {
    console.log('Так, зможе нагородити!');
} else {
    console.log('Ні, не зможе нагородити!');
}

*/

/* Задача 5.

Ви є організатором розважальної програми і вам потрібно розподілити вхідні квитки на основі віку відвідувачів. 
Вхідні квитки мають різні ціни в залежності від віку відвідувачів. 
Вам потрібно реалізувати таку логіку, яка в залежності від віку відвідувача повертає вартість його квитка згідно наступних умов:

- Діти до 6 років: безкоштовний вхід
- Діти від 6 до 12 років (включно): квиток коштує $10
- Дорослі від 12 років і старше: квиток коштує $20

Якщо дорослий надає документ, що підтверджує його право на пільги, то такому дорослому надається знижка 50% (знижка для всіх дорослих фіксована, незалежно від виду пільги).


*/

const age = 20; // Вік відвідувача
const hasDiscount = false; // Наявність знижки у дорослого

let ticketPrice; // зараз тут undefined

if(age < 0 || typeof age !== 'number') { // якщо вік < 0 АБО вік НЕ є числом
    console.log('Ви ввели некоректний вік користувача. Спробуйте ще раз.');
} else if(age <= 6) {
    ticketPrice = 0;
} else if(age <= 12) {
    ticketPrice = 10;
} else if(!hasDiscount) { // !hasDiscount --> hasDiscount === false
    ticketPrice = 20;
} else {
    ticketPrice = 10;
}

if(ticketPrice !== undefined) {
    console.log('Вартість квитка складає: ' + ticketPrice + '$');
}