// && ("і")
// && - бінарний оператор, повертає boolean
// && повертає істину тільки тоді, коли обидва операнди є істинними
// в якості операндів тут будуть умови
// якщо обидві умови будуть true - && повертає true
// якщо хоча б одна з умов буде false - && повертає false

/* Задача: перевірити вік людини і наявність права на управління авто. 
На підставі цього зробити висновок, чи може людина сісти за руль чи ні

Базові правила:
Керування авто можливе з 18 років + для цього потрібні права
*/

const age = 39;
const hasLicense = true;

if(age >= 18 && hasLicense === true) {
    console.log('Ви можете сідати за руль');
} else if(age <= 18) {
    console.log('Ви не можете сідати за руль, бо ви ще не досягли віку, вам ' + age + ' років');
} else if(hasLicense === false) {
    console.log('У вас немає спеціальних прав на керування т/с');
} else {
    console.log('Виникла помилка...)');
}