/*

if - else if - else

Синтаксис.

if(умова 1) {
    блок коду, який виконається, якшо умова1 = true
} else if(умова 2) {
    блок коду, який виконається, якшо умова2 = true
} else {
    блок коду, який виконається, якщо умова1 і умова2 = false
}

*/

/*

Дано число r.
Якщо r > 12 - вивести в консоль 'більше 12'.
В противному випадку, якщо r < 5 - вивести в консоль 'менше 5'.
В противному випадку - вивести 'в діапазоні між 5 і 12'.

*/

let r = 9;
let strWithR = 'r = ' + r;

if(r > 12) {
    console.log(strWithR + ', більше 12');
} else if(r < 5) {
    console.log(strWithR + ', менше 5');
} else {
    console.log(strWithR + ', в діапазоні між 5 і 12');
}