// array.concat - використовується для об'єднання двох або більше масивів у новий масив (немутуючий)
// array.fill - використовується для заповнення всіх елементів масиву якимсь одним значенням (мутуючий)
// array.includes - використовується для перевірки наявності певного значення у масиві (немутуючий)
// array.indexOf - використовується для отримання першого входження певного значення у масиві (немутуючий)
// array.join - використовується для створення рядка, об'єднуючи всі елементи масиву (немутуючий)
// array.push - використовується для додавання одного або кількох елементів у кінець (мутуючий)
// array.pop - використовується для видалення останнього елементу (мутуючий)


// array.shift - використовується для видалення першого елементу з початку масиву (мутуючий)
const arr1 = [5, 12, 11, 24, 85];
// console.log(arr1.shift());

// array.unshift - використовується для додавання одного або декількох елементів на початок масиву (мутуючий)
// array.unshift(element1, element2, ..., elementN)
const arr2 = [1, 2, 3, 4];
// console.log(arr2.unshift(-1, 0));

// array.reverse - використовується для зміни порядку елементів у масиві на протилежний (мутуючий)
const arr3 = [1, 2, 3, 4, 5, 6];
console.log(arr3.reverse());

// Методи, які змінюють вихідний масив - мутуючі методи
// Методи, які НЕ змінюють вихідний масив - немутуючі методи (більшість методів масиву)