// Вкладені цикли (Double Loop)

/*
Вивести на консоль таблицю множення від 1 до 5

1x1 = 1
1x2 = 2
....1x5 = 5

2x1 = 2
2x2 = 4

....

5x1 = 5
5x2 = 10
5x3
5x4
5x5


*/

// for(let i = 1; i <= 5; i++) { // 1 - число, для якого ми виводимо таблицю множення
//   for(let j=1; j <= 5; j++) { // 1*1, 1*2, 1*3, 1*4, 1*5 - числа, на які ми множимо число з зовнішнього циклу
//     console.log(`${i} x ${j} = ${i*j}`);
//   }
// }

const numbers = [[1, 1, 1], [1, 1, 1], [1, 1, 1]];

// Задача: знайти суму елементів масиву numbers

let sum = 0;
for(let i = 0; i < numbers.length; i++) { // зовнішній цикл контролює масив, який ми переглдаємо
  for(let j = 0; j < numbers[i].length; j++) { // внутрішній цикл сумує всі елементи поточного просматріваемого вкладеного масиву
    sum += numbers[i][j]; // отримуємо доступ до поточного елементу просматріваемого вкладеного масиву
  }
}

console.log(sum);