// Унарні, бінарні, тернарні

// Тернарний оператор - потребує 3-х операндів

// Тернарний оператор дозволяє вибрати 1 з 2 операндів на основі заданої умови.

// let result = умова ? операнд1 : операнд2;

// операнд1 - значення для змінної result, якщо умова буде true
// операнд2 - значення для змінної result, якщо умова буде false

const age = 19;

// Задача: реалізувати обмеження, щоб особи які не досягли 18 років не могли купувати алкогольні та тютюнові вироби

const isAdult = age > 18 ? true : false;

console.log(isAdult);

/* Задача 1


1. Створіть булеву змінну isAuth, в якій самостійно визначте, чи авторизований користувач, чи ні.
Тобто, привласніть цій змінній значення true або false.

2. Створіть змінну viewMode, яка у випадку авторизованного користувача маж містити рядок 'authMode',
а у випадку не авторизованного користувача - 'unauth'. (тернарний оператор)

*/

const isAuth = true;

const viewMode = isAuth ? 'authMode' : 'unauth';

console.log(viewMode);

/* Задача 2

У нас є число.
Потрібно перевірити входження числа у діапазон (з використанням тернарного оператора!)

Якщо число входить у діапазон від 6 до 12, то у змінній має міститись рядок "in", в протилежному випадку рядок "out"


*/

const number = 5;

const result = (number >= 6 && number <= 12) ? 'in' : 'out';

console.log(result);